[
  {
    "dateTo": "Agosto 2024",
    "dateFrom": "Actualidad",
    "company": "ABDAK S.A.C",
    "type": "Presencial",
    "responsability": [
      {
        "detail": "Maquetación del sitio Web: Encargado del la maquetación de los diseños entregados por el área de Marketing/Diseño. Tanto de manera normal, como de forma de manera responsiva para celulares, haciendo el código entendible y escalable."
      },
      {
        "detail": "Integración de Nuevas Funcionalidades: Especializado en la integración y desarrollo de nuevas funcionalidades que mejoran la eficiencia y la usabilidad de las aplicaciones y sistemas de la empresa."
      },
      {
        "detail": "Consumo y Mantenimiento de API's: Participación activa en el consumo, implementación y mantenimiento de API's, asegurando su correcto funcionamiento y escalabilidad."
      },
      {
        "detail": "Conexión Frontend-Backend: Encargado del consumo de API's, utilizando tecnologías como Axios, React y Next.js, facilitando una comunicación fluida entre las interfaces de usuario y los servicios backend."
      }
    ]
  },
  {
    "dateTo": "Enero 2023",
    "dateFrom": "Diciembre 2023",
    "company": "Ceintec E.I.R.L",
    "type": "Remoto",
    "responsability": [
      {
        "detail": "Encargado de diseñar y maquetar las interfaces de los proyectos."
      },
      {
        "detail": "Integración de componentes dinámicos y funcionalidades interactivas con Vue.js.Analizar la estructura de la base de datos y de los proyectos antiguos para optimizarlos."
      },
      {
        "detail": "Dar soporte a los proyectos."
      },
      {
        "detail": "Cambiar las tecnologías de algunos proyectos."
      },
      {
        "detail": "Trato directo con los clientes para tomar sus requerimientos."
      }
    ]
  },
  {
    "dateTo": "Julio 2022",
    "dateFrom": "Diciembre 2022",
    "company": "Pyrus S.A.C",
    "type": "Remoto",
    "responsability": [
      {
        "detail": "Maquetar los Diseños UI designados por el área de Diseño, sitios webs con HTML, CSS,Javasrcipt y VUE."
      },
      {
        "detail": "Encargado de refactorizar partes del código para obtener un mejor CEO del sistema.."
      },
      {
        "detail": "Consumo de API´s utilizando Laravel como backend, trabajando junto con los encargados de los servicios."
      },
      {
        "detail": "Manejo de errores por el lado del cliente."
      }
    ]
  }
]
